#+AUTHOR: Рогов Я.С.
#+TITLE: NONE
#+LANGUAGE: ru
#+LATEX_HEADER: \subject{Автоматическая обработка естественного языка}
#+LATEX_HEADER: \labnum{2}
#+LATEX_HEADER: \variant{}
#+LATEX_HEADER: \professor{Г. Д. Вольгенаннт}
#+LATEX_HEADER: \groupname{P41182}
#+TAGS: noexport

#+STARTUP: showall hideblocks inlineimages indent
#+STARTUP: latexpreview

#+OPTIONS: ':t -:t ::t <:t \n:nil ^:t f:t |:t e:t
#+OPTIONS: author:t broken-links:mark date:t title:t
#+OPTIONS: tex:t toc:nil

#+OPTIONS: H:3

# Do not export TODO-related text, tags, properties,
#+OPTIONS: todo:nil tags:nil prop:nil
# drawers, inline tasks and statistics cookies ([0/3] in TODOs)
#+OPTIONS: d:nil inline:nil stat:nil

#+LATEX_COMPILER: xelatex
#+LATEX_CLASS: itmo-report

#+PROPERTY: header-args :session lab2 :cache yes :exports code :results output :wrap src text
* Download Alice's Adventures in Wonderland
#+name: alice_filename
#+begin_src restclient :results value file :file data/alice.txt :wrap
GET https://www.gutenberg.org/files/11/11-0.txt
#+end_src

#+RESULTS[44c44dbd533a2c0c6d5d5eae138ab006dd60f590]: alice_filename
#+begin_results
[[file:data/alice.txt]]
#+end_results

